In [27]:
import numpy as np
import pandas as pd

In [28]:
sozluk1 = {"Isım" : ["Ahmet","Mehmet","Zeynep","Atıl"],
            "Spor": ["Koşu","Yüzme","Koşu","Futbol"],
          "Kalori" : [100,200,300,400]}

In [29]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [30]:
dataFrame1

     Isım    Spor  Kalori
0   Ahmet    Koşu     100
1  Mehmet   Yüzme     200
2  Zeynep    Koşu     300
3    Atıl  Futbol     400

In [31]:
sozluk2 = {"Isım" : ["Osman","Levent","Atlas","Fatma"],
            "Spor": ["Koşu","Yüzme","Koşu","Futbol"],
          "Kalori" : [230,240,300,440]}

In [32]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [33]:
dataFrame2

     Isım    Spor  Kalori
4   Osman    Koşu     230
5  Levent   Yüzme     240
6   Atlas    Koşu     300
7   Fatma  Futbol     440

In [34]:
sozluk3= {"Isım" : ["Ayse","MAhöut","Duygu","Nur"],
            "Spor": ["Koşu","Yüzme","Koşu","Futbol"],
          "Kalori" : [288,123,454,125]}

In [35]:
dataFrame3 = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [36]:
dataFrame3

      Isım    Spor  Kalori
8     Ayse    Koşu     288
9   MAhöut   Yüzme     123
10   Duygu    Koşu     454
11     Nur  Futbol     125

## concatenation

In [39]:
 pd.concat([dataFrame1,dataFrame2,dataFrame3]) #concat komutuyla tabloları birleştirdik kolonları birleştirdik yani axis = 0

      Isım    Spor  Kalori
0    Ahmet    Koşu     100
1   Mehmet   Yüzme     200
2   Zeynep    Koşu     300
3     Atıl  Futbol     400
4    Osman    Koşu     230
5   Levent   Yüzme     240
6    Atlas    Koşu     300
7    Fatma  Futbol     440
8     Ayse    Koşu     288
9   MAhöut   Yüzme     123
10   Duygu    Koşu     454
11     Nur  Futbol     125

## merge

In [41]:
mergeSozluk1 = {"Isım" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
               }

In [42]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [43]:
mergeDataFrame1

     Isım       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [44]:
mergeSozluk2 = {"Isım" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,159,277]
               }

In [45]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [46]:
mergeDataFrame2

     Isım  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     159
3    Atıl     277

In [47]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "Isım") ##ortak kolon isim oldu on komutu yazmamızı sağladı

     Isım       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     159
3    Atıl  Basketbol     277

In [51]:
maasSozluk = {"Isım": ["Atıl","Zeynep","Mehmet","Ahmet"],"Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],"Maas" : [100,200,300,400]}

In [52]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [53]:
maasDataFrame

     Isım  Departman  Maas
0    Atıl    Yazılım   100
1  Zeynep      Satış   200
2  Mehmet  Pazarlama   300
3   Ahmet    Yazılım   400

In [55]:
maasDataFrame["Departman"].unique()  #unique komutuyla sadece tür olarak getirdi

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [56]:
maasDataFrame["Departman"].nunique() #nunique sayısını getirdi

3

In [58]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [62]:
def bruttenNete(maas):
    return maas *0.66

In [63]:
maasDataFrame["Maas"].apply(bruttenNete)

0     66.0
1    132.0
2    198.0
3    264.0
Name: Maas, dtype: float64

In [64]:
maasDataFrame.isnull()

    Isım  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False